export const ltlOverweightColHeaders = ['Норма веса', 'Тип услуги'];

export const ltlPrrColHeaders = ['Название услуги', 'Тип услуги', 'Стоимость за паллет без НДС'];

export const ltlDowntimeColumns = [
  {type: 'dropdown', source: ['Москва и МО', 'Регионы']},
  {type: 'dropdown', source: ['LT', 'MG']},
  {type: 'dropdown', source: ['12', '24']},
  {type: 'numeric'},
  {type: 'numeric'},
  {type: 'numeric'}
];

export const ltlDowntimeNestedHeaders = [
  [
    'Простои в',
    'Тип услуги',
    `Время начала<br/> платного простоя`,
    {
      label: 'Стоимость за паллет/сутки, руб. без НДС',
      colspan: 3
    }
  ], ['', '', '', 'Тент', 'Изотерм', 'Реф']
];

export const ltlStandardDataUtil = () => {
  return [
    ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '']
  ]
}

export const ltlRailwayDataUtil = () => {
  return [
    ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '']
  ]
}

export const ltlStandardNestedHeaders = [
  [
    `Склад</br> заказчика`,
    'Склад FM',
    'Доставка',
    `Тип грузовой</br> единицы`,
    `Город</br> выгрузки`,
    `Тип</br> грузополучателя`,
    'Тип кузова',
    {
      label: `Стоимость доставки 1 паллетоместа при следующем</br> количестве паллет в поставке, руб. без НДС и без копеек`,
      colspan: 9
    }
  ], ['', '', '', '', '', '', '', '1', '2', '3', '4', '5', '6-8', '9-15', '16-20', '21-25']
];

export const ltlRailwayNestedHeaders = [
  [
    `Склад</br> заказчика`,
    'Склад FM',
    'Доставка',
    `Тип грузовой</br> единицы`,
    `Город</br> выгрузки`,
    `Тип</br> грузополучателя`,
    'Тип кузова',
    {
      label: `Стоимость доставки 1 паллетоместа при следующем</br> количестве паллет в поставке, руб. без НДС и без копеек`,
      colspan: 9
    }
  ], ['', '', '', '', '', '', '', '1', '2', '3', '4', '5', '6-8', '9-15', '16-20', '21-25']
];

export const ltlDowntimeDataUtil = () => {
  return [
    ['Москва и МО', 'LT', '12', '', '', ''],
    ['Москва и МО', 'LT', '24', '', '', ''],
    ['Регионы', 'LT', '24', '', '', ''],
    ['Москва и МО', 'MG', '12', '', '', ''],
    ['Москва и МО', 'MG', '24', '', '', ''],
    ['Регионы', 'MG', '24', '', '', '']
  ];
};

export const ltlOverweightDataUtil = () => {
  return [
    ['', 'MG'], ['', 'LT'], ['', 'LZ'], ['', 'ZL']
  ];
}

export const ltlPrrDataUtil = () => {
  return [
    ['Погрузо-разгрузочные работы водителем, (ручные)', 'LT', ''],
    ['Погрузо-разгрузочные работы водителем, (механизированные)', 'LT', ''],
    ['Погрузо-разгрузочные работы водителем, (ручные)', 'MG', ''],
    ['Погрузо-разгрузочные работы водителем, (механизированные)', 'MG', '']
  ];
}